# Teclov Investments

## *Problem 5: Sector Analysis II Final Results*

***
#### Result Summary
1. *Total Count of Investments: USA - 1284, GBR - 582 , India - 315*
2. *Total Amount of Investments:* 
   - USA -  One hundred billion nine hundred eighty-two million six hundred sixty-six thousand seven hundred seventy-nine
   - GBR -   Five billion fifty-three million two hundred ninety-three thousand four hundred six
   - India -  Two billion eight hundred twenty million six hundred seventy-three thousand six hundred two
***
3. *Top Sector (based on count of investments): 
USA - Others, GBR - Others, India - Others*

4. *Second best sector (based on count of investments): <b> <span style='color:Blue'>
Social, Finance, Analytics, Advertising in all the three countries. </b></span>*

5. *Third best sector (based on count of investments): <b> <span style='color:Green'>
USA: Cleantech/Semiconductors, GBR: Cleantech/Semiconductors, India: News,Search and Messaging </b></span>*
***

6. *Number of Investments in the top sector: <b> USA: 2757, GBR: 140, India: 103* </b>

7. *Number of Investments in the second best sector: <b> USA: 2590 , GBR: 140 , India: 103* </b>

8. *Number of Investments in the third best sector: <b> USA:2192, GBR: 116  , India: 49* </b>

9. *For the top sector count wise, company that received the highest investment: <b> USA:Capella, Udacity, Great Britain: Tribold, Not On The High Street, India:Zo rooms, Limeroad, Common Floor* </b>

10. *For the second best sector count wise, company that received the highest investment: <b> USA: Univa, Turn, Great Britain: My Things, Zopa, SimilarWeb, India: Travelguru, Shopclues.com, Shriram Credit* </b>

***

In [1]:
#system specific
import os
import sys
assert sys.version_info >= (3,5)

#import the needed libraries
import numpy as np
import pandas as pd

#visualizations
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

#handle unwanted warnings
import warnings
warnings.filterwarnings(action='ignore',category=DeprecationWarning)
warnings.filterwarnings(action='ignore',category=FutureWarning)

#consistent size plot
from pylab import rcParams
rcParams['figure.figsize']= 12,5
rcParams['xtick.labelsize']= 12
rcParams['ytick.labelsize']= 12
rcParams['axes.labelsize']= 12

#enable viewing of all the columns in a df
pd.options.display.max_columns = None

In [3]:
#load the data
usa = pd.read_csv('D1.csv',delimiter=',',encoding='ISO-8859-2')
gbr = pd.read_csv('D2.csv',delimiter=',',encoding='ISO-8859-2')
ind = pd.read_csv('D3.csv',delimiter=',',encoding='ISO-8859-2')

In [4]:
usa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11284 entries, 0 to 11283
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   permalink           11284 non-null  object
 1   name                11284 non-null  object
 2   category_list       11284 non-null  object
 3   status              11284 non-null  object
 4   country_code        11284 non-null  object
 5   founded_at          9839 non-null   object
 6   company_permalink   11284 non-null  object
 7   funding_round_type  11284 non-null  object
 8   funded_at           11284 non-null  object
 9   raised_amount_usd   11284 non-null  float64
 10  main_sector         11284 non-null  object
dtypes: float64(1), object(10)
memory usage: 969.8+ KB

In [5]:
usa['status'].value_counts()

operating    7851
acquired     2853
ipo           580
Name: status, dtype: int64

### Total Amount Invested in each Main Sector

#### *Country 1: United States of America*

In [13]:
#get the total amount invested in each main sector in USA
usa.pivot_table(values='raised_amount_usd',index='main_sector',aggfunc='sum').sort_values(by='raised_amount_usd',ascending=False)

                                         raised_amount_usd
main_sector
Others                                        2.463070e+10
Social, Finance, Analytics, Advertising       2.283077e+10
Cleantech / Semiconductors                    2.012233e+10
News, Search and Messaging                    1.297691e+10
Health                                        7.744830e+09
Manufacturing                                 6.700079e+09
Entertainment                                 4.602750e+09
Automotive & Sports                           1.374304e+09

#### *Country 2: Great Britain*

In [12]:
#get the total amount invested in each main sector in Great Britain
gbr.pivot_table(values='raised_amount_usd',index='main_sector',aggfunc='sum').sort_values(by='raised_amount_usd',ascending=False)

                                         raised_amount_usd
main_sector
Others                                        1.215442e+09
Social, Finance, Analytics, Advertising       1.054628e+09
Cleantech / Semiconductors                    1.048294e+09
News, Search and Messaging                    5.585007e+08
Entertainment                                 4.635147e+08
Manufacturing                                 3.433243e+08
Health                                        2.025375e+08
Automotive & Sports                           1.670516e+08

#### *Country 3: India*

In [14]:
#get the total amount invested in each main sector in India
ind.pivot_table(values='raised_amount_usd',index='main_sector',aggfunc='sum').sort_values(by='raised_amount_usd',ascending=False)

                                         raised_amount_usd
main_sector
Others                                         940289507.0
Social, Finance, Analytics, Advertising        535549550.0
News, Search and Messaging                     408834545.0
Entertainment                                  272080000.0
Manufacturing                                  200900000.0
Cleantech / Semiconductors                     165380000.0
Health                                         160740000.0
Automotive & Sports                            136900000.0

### Total number (count) of Investments in each Main Sector

#### *Country 1: United States of America*

In [17]:
#United States of America
usa.pivot_table(values='raised_amount_usd',index='main_sector',aggfunc='count').sort_values(by='raised_amount_usd',ascending=False)

                                         raised_amount_usd
main_sector
Others                                                2757
Social, Finance, Analytics, Advertising               2590
Cleantech / Semiconductors                            2192
News, Search and Messaging                            1464
Health                                                 854
Manufacturing                                          739
Entertainment                                          531
Automotive & Sports                                    157

#### *Country 2: Great Britain*

In [18]:
#Great Britain
gbr.pivot_table(values='raised_amount_usd',index='main_sector',aggfunc='count').sort_values(by='raised_amount_usd',ascending=False)

                                         raised_amount_usd
main_sector
Others                                                 140
Social, Finance, Analytics, Advertising                128
Cleantech / Semiconductors                             116
News, Search and Messaging                              66
Entertainment                                           53
Manufacturing                                           40
Health                                                  23
Automotive & Sports                                     16

#### *Country 3: India*

In [19]:
#India
ind.pivot_table(values='raised_amount_usd',index='main_sector',aggfunc='count').sort_values(by='raised_amount_usd',ascending=False)

                                         raised_amount_usd
main_sector
Others                                                 103
Social, Finance, Analytics, Advertising                 59
News, Search and Messaging                              49
Entertainment                                           32
Manufacturing                                           21
Cleantech / Semiconductors                              20
Health                                                  18
Automotive & Sports                                     13

In [20]:
ind.shape

(315, 11)

In [21]:
usa.shape

(11284, 11)

In [22]:
gbr.shape

(582, 11)

In [23]:
usa['raised_amount_usd'].sum()

100982666779.0

In [24]:
gbr['raised_amount_usd'].sum()

5053293406.0

In [25]:
ind['raised_amount_usd'].sum()

2820673602.0

### For the top sector, the company that received the highest investment

#### USA

In [38]:
# for the top sector, the company that received the highest investment
usa[usa['main_sector']=='Others'][['permalink','raised_amount_usd']].sort_values(by='raised_amount_usd',ascending=False)[:5]

                     permalink  raised_amount_usd
1826                   capella         15000000.0
10224                  udacity         15000000.0
5122              justfabulous         15000000.0
3058               doubledutch         15000000.0
1691   broadcast-international         15000000.0

#### Great Britain

In [39]:
# for the top sector, the company that received the highest investment
gbr[gbr['main_sector']=='Others'][['permalink','raised_amount_usd']].sort_values(by='raised_amount_usd',ascending=False)[:5]

              permalink  raised_amount_usd
511             tribold         15000000.0
336  notonthehighstreet         15000000.0
154       environmentiq         15000000.0
230           ip-access         15000000.0
438             sensage         15000000.0

#### India

In [40]:
# for the top sector, the company that received the highest investment
ind[ind['main_sector']=='Others'][['permalink','raised_amount_usd']].sort_values(by='raised_amount_usd',ascending=False)[:5]

                         permalink  raised_amount_usd
309                       zo-rooms         15000000.0
158                       limeroad         15000000.0
56                     commonfloor         15000000.0
51   classteacher-learning-systems         15000000.0
105                     girnarsoft         15000000.0

### For the second best sector, the company that received the highest investment

### USA

In [42]:
usa[usa['main_sector']=='Social, Finance, Analytics, Advertising'][['permalink','raised_amount_usd']].sort_values(by='raised_amount_usd',ascending=False)[:5]

               permalink  raised_amount_usd
10257              univa         15000000.0
10159               turn         15000000.0
10101           true-fit         15000000.0
3614   fast-pay-partners         15000000.0
1418               bitly         15000000.0

### Great Britain

In [43]:
gbr[gbr['main_sector']=='Social, Finance, Analytics, Advertising'][['permalink','raised_amount_usd']].sort_values(by='raised_amount_usd',ascending=False)[:5]

        permalink  raised_amount_usd
314      mythings         15000000.0
579          zopa         15000000.0
452    similarweb         15000000.0
362     opengamma         15000000.0
468  sportpursuit         14448230.0

### India

In [44]:
ind[ind['main_sector']=='Social, Finance, Analytics, Advertising'][['permalink','raised_amount_usd']].sort_values(by='raised_amount_usd',ascending=False)[:5]

           permalink  raised_amount_usd
279       travelguru         15000000.0
255    shopclues-com         15000000.0
254    shiram-credit         15000000.0
12          apnaloan         15000000.0
173  manthan-systems         15000000.0